#Узнайте у пользователя целое положительное число n.
#Найдите сумму чисел n + nn + nnn.

n = int(input("Write n: "))
print(f"n + nn + nnn = {n}{2 * n}{3 * n}")
